Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_application_saadc.
; ==========================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_application_saadc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// SAADC address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    TASKS_START;
    volatile    uint32_t    TASKS_SAMPLE;
    volatile    uint32_t    TASKS_STOP;
    volatile    uint32_t    TASKS_CALIBRATEOFFSET;
    volatile    uint32_t    RESERVED0[28];
    volatile    uint32_t    SUBSCRIBE_START;
    volatile    uint32_t    SUBSCRIBE_SAMPLE;
    volatile    uint32_t    SUBSCRIBE_STOP;
    volatile    uint32_t    SUBSCRIBE_CALIBRATEOFFSET;
    volatile    uint32_t    RESERVED1[28];
    volatile    uint32_t    EVENTS_STARTED;
    volatile    uint32_t    EVENTS_END;
    volatile    uint32_t    EVENTS_DONE;
    volatile    uint32_t    EVENTS_RESULTDONE;
    volatile    uint32_t    EVENTS_CALIBRATEDONE;
    volatile    uint32_t    EVENTS_STOPPED;
    volatile    uint32_t    EVENTS_CH0_LIMITH;
    volatile    uint32_t    EVENTS_CH0_LIMITL;
    volatile    uint32_t    EVENTS_CH1_LIMITH;
    volatile    uint32_t    EVENTS_CH1_LIMITL;
    volatile    uint32_t    EVENTS_CH2_LIMITH;
    volatile    uint32_t    EVENTS_CH2_LIMITL;
    volatile    uint32_t    EVENTS_CH3_LIMITH;
    volatile    uint32_t    EVENTS_CH3_LIMITL;
    volatile    uint32_t    EVENTS_CH4_LIMITH;
    volatile    uint32_t    EVENTS_CH4_LIMITL;
    volatile    uint32_t    EVENTS_CH5_LIMITH;
    volatile    uint32_t    EVENTS_CH5_LIMITL;
    volatile    uint32_t    EVENTS_CH6_LIMITH;
    volatile    uint32_t    EVENTS_CH6_LIMITL;
    volatile    uint32_t    EVENTS_CH7_LIMITH;
    volatile    uint32_t    EVENTS_CH7_LIMITL;
    volatile    uint32_t    RESERVED2[10];
    volatile    uint32_t    PUBLISH_STARTED;
    volatile    uint32_t    PUBLISH_END;
    volatile    uint32_t    PUBLISH_DONE;
    volatile    uint32_t    PUBLISH_RESULTDONE;
    volatile    uint32_t    PUBLISH_CALIBRATEDONE;
    volatile    uint32_t    PUBLISH_STOPPED;
    volatile    uint32_t    PUBLISH_CH0_LIMITH;
    volatile    uint32_t    PUBLISH_CH0_LIMITL;
    volatile    uint32_t    PUBLISH_CH1_LIMITH;
    volatile    uint32_t    PUBLISH_CH1_LIMITL;
    volatile    uint32_t    PUBLISH_CH2_LIMITH;
    volatile    uint32_t    PUBLISH_CH2_LIMITL;
    volatile    uint32_t    PUBLISH_CH3_LIMITH;
    volatile    uint32_t    PUBLISH_CH3_LIMITL;
    volatile    uint32_t    PUBLISH_CH4_LIMITH;
    volatile    uint32_t    PUBLISH_CH4_LIMITL;
    volatile    uint32_t    PUBLISH_CH5_LIMITH;
    volatile    uint32_t    PUBLISH_CH5_LIMITL;
    volatile    uint32_t    PUBLISH_CH6_LIMITH;
    volatile    uint32_t    PUBLISH_CH6_LIMITL;
    volatile    uint32_t    PUBLISH_CH7_LIMITH;
    volatile    uint32_t    PUBLISH_CH7_LIMITL;
    volatile    uint32_t    RESERVED3[74];
    volatile    uint32_t    INTEN;
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED4[61];
    volatile    uint32_t    STATUS;
    volatile    uint32_t    RESERVED5[63];
    volatile    uint32_t    ENABLE;
    volatile    uint32_t    RESERVED6[3];
    volatile    uint32_t    CH0_PSELP;
    volatile    uint32_t    CH0_PSELN;
    volatile    uint32_t    CH0_CONFIG;
    volatile    uint32_t    CH0_LIMIT;
    volatile    uint32_t    CH1_PSELP;
    volatile    uint32_t    CH1_PSELN;
    volatile    uint32_t    CH1_CONFIG;
    volatile    uint32_t    CH1_LIMIT;
    volatile    uint32_t    CH2_PSELP;
    volatile    uint32_t    CH2_PSELN;
    volatile    uint32_t    CH2_CONFIG;
    volatile    uint32_t    CH2_LIMIT;
    volatile    uint32_t    CH3_PSELP;
    volatile    uint32_t    CH3_PSELN;
    volatile    uint32_t    CH3_CONFIG;
    volatile    uint32_t    CH3_LIMIT;
    volatile    uint32_t    CH4_PSELP;
    volatile    uint32_t    CH4_PSELN;
    volatile    uint32_t    CH4_CONFIG;
    volatile    uint32_t    CH4_LIMIT;
    volatile    uint32_t    CH5_PSELP;
    volatile    uint32_t    CH5_PSELN;
    volatile    uint32_t    CH5_CONFIG;
    volatile    uint32_t    CH5_LIMIT;
    volatile    uint32_t    CH6_PSELP;
    volatile    uint32_t    CH6_PSELN;
    volatile    uint32_t    CH6_CONFIG;
    volatile    uint32_t    CH6_LIMIT;
    volatile    uint32_t    CH7_PSELP;
    volatile    uint32_t    CH7_PSELN;
    volatile    uint32_t    CH7_CONFIG;
    volatile    uint32_t    CH7_LIMIT;
    volatile    uint32_t    RESERVED7[24];
    volatile    uint32_t    RESOLUTION;
    volatile    uint32_t    OVERSAMPLE;
    volatile    uint32_t    SAMPLERATE;
    volatile    uint32_t    RESERVED8[12];
    volatile    uint32_t    RESULT_PTR;
    volatile    uint32_t    RESULT_MAXCNT;
    volatile    uint32_t    RESULT_AMOUNT;
} SAADC_TypeDef;

#ifdef __cplusplus
#define SAADC_NS    reinterpret_cast<SAADC_TypeDef *>(0x4000E000u)
#define SAADC_S     reinterpret_cast<SAADC_TypeDef *>(0x5000E000u)

#else
#define SAADC_NS    ((SAADC_TypeDef *)0x4000E000u)
#define SAADC_S     ((SAADC_TypeDef *)0x5000E000u)
#endif

// TASKS_START Configuration

#define SAADC_TASKS_START_TASKS_START                                   (0x1u<<0)
#define SAADC_TASKS_START_TASKS_START_TRIGGER                           (0x1u<<0)

