Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
// TASKS_SAMPLE Configuration

#define SAADC_TASKS_SAMPLE_TASKS_SAMPLE                                 (0x1u<<0)
#define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_TRIGGER                         (0x1u<<0)

// TASKS_STOP Configuration

#define SAADC_TASKS_STOP_TASKS_STOP                                     (0x1u<<0)
#define SAADC_TASKS_STOP_TASKS_STOP_TRIGGER                             (0x1u<<0)

// TASKS_CALIBRATEOFFSET Configuration

#define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET               (0x1u<<0)
#define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_TRIGGER       (0x1u<<0)

// SUBSCRIBE_START Configuration

#define SAADC_SUBSCRIBE_START_EN                                        (0x1u<<31)
#define SAADC_SUBSCRIBE_START_CHIDX                                     (0xFFu<<0)
#define SAADC_SUBSCRIBE_START_CHIDX_0                                   (0x1u<<0)
#define SAADC_SUBSCRIBE_START_EN_DISABLED                               (0x0u<<31)
#define SAADC_SUBSCRIBE_START_EN_ENABLED                                (0x1u<<31)

// SUBSCRIBE_SAMPLE Configuration

#define SAADC_SUBSCRIBE_SAMPLE_EN                                       (0x1u<<31)
#define SAADC_SUBSCRIBE_SAMPLE_CHIDX                                    (0xFFu<<0)
#define SAADC_SUBSCRIBE_SAMPLE_CHIDX_0                                  (0x1u<<0)
#define SAADC_SUBSCRIBE_SAMPLE_EN_DISABLED                              (0x0u<<31)
#define SAADC_SUBSCRIBE_SAMPLE_EN_ENABLED                               (0x1u<<31)

// SUBSCRIBE_STOP Configuration

#define SAADC_SUBSCRIBE_STOP_EN                                         (0x1u<<31)
#define SAADC_SUBSCRIBE_STOP_CHIDX                                      (0xFFu<<0)
#define SAADC_SUBSCRIBE_STOP_CHIDX_0                                    (0x1u<<0)
#define SAADC_SUBSCRIBE_STOP_EN_DISABLED                                (0x0u<<31)
#define SAADC_SUBSCRIBE_STOP_EN_ENABLED                                 (0x1u<<31)

// SUBSCRIBE_CALIBRATEOFFSET Configuration

#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN                              (0x1u<<31)
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX                           (0xFFu<<0)
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_0                         (0x1u<<0)
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_DISABLED                     (0x0u<<31)
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_ENABLED                      (0x1u<<31)

// EVENTS_STARTED Configuration

#define SAADC_EVENTS_STARTED_EVENTS_STARTED                             (0x1u<<0)
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_NOTGENERATED                (0x0u<<0)
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_GENERATED                   (0x1u<<0)

// EVENTS_END Configuration

#define SAADC_EVENTS_END_EVENTS_END                                     (0x1u<<0)
#define SAADC_EVENTS_END_EVENTS_END_NOTGENERATED                        (0x0u<<0)
#define SAADC_EVENTS_END_EVENTS_END_GENERATED                           (0x1u<<0)

// EVENTS_DONE Configuration

#define SAADC_EVENTS_DONE_EVENTS_DONE                                   (0x1u<<0)
#define SAADC_EVENTS_DONE_EVENTS_DONE_NOTGENERATED                      (0x0u<<0)
#define SAADC_EVENTS_DONE_EVENTS_DONE_GENERATED                         (0x1u<<0)

// EVENTS_RESULTDONE Configuration

#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE                       (0x1u<<0)
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_NOTGENERATED          (0x0u<<0)
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_GENERATED             (0x1u<<0)

// EVENTS_CALIBRATEDONE Configuration

#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE                 (0x1u<<0)
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_NOTGENERATED    (0x0u<<0)
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_GENERATED       (0x1u<<0)

// EVENTS_STOPPED Configuration

#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED                             (0x1u<<0)
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_NOTGENERATED                (0x0u<<0)
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_GENERATED                   (0x1u<<0)

// LIMITH Configuration

#define SAADC_EVENTS_CH_LIMITH_LIMITH                                   (0x1u<<0)
#define SAADC_EVENTS_CH_LIMITH_LIMITH_NOTGENERATED                      (0x0u<<0)
#define SAADC_EVENTS_CH_LIMITH_LIMITH_GENERATED                         (0x1u<<0)

// LIMITL Configuration

#define SAADC_EVENTS_CH_LIMITL_LIMITL                                   (0x1u<<0)
#define SAADC_EVENTS_CH_LIMITL_LIMITL_NOTGENERATED                      (0x0u<<0)
#define SAADC_EVENTS_CH_LIMITL_LIMITL_GENERATED                         (0x1u<<0)

// PUBLISH_STARTED Configuration

#define SAADC_PUBLISH_STARTED_EN                                        (0x1u<<31)
#define SAADC_PUBLISH_STARTED_CHIDX                                     (0xFFu<<0)
#define SAADC_PUBLISH_STARTED_CHIDX_0                                   (0x1u<<0)
#define SAADC_PUBLISH_STARTED_EN_DISABLED                               (0x0u<<31)
#define SAADC_PUBLISH_STARTED_EN_ENABLED                                (0x1u<<31)

// PUBLISH_END Configuration

#define SAADC_PUBLISH_END_EN                                            (0x1u<<31)
#define SAADC_PUBLISH_END_CHIDX                                         (0xFFu<<0)
#define SAADC_PUBLISH_END_CHIDX_0                                       (0x1u<<0)
#define SAADC_PUBLISH_END_EN_DISABLED                                   (0x0u<<31)
#define SAADC_PUBLISH_END_EN_ENABLED                                    (0x1u<<31)

// PUBLISH_DONE Configuration

#define SAADC_PUBLISH_DONE_EN                                           (0x1u<<31)
#define SAADC_PUBLISH_DONE_CHIDX                                        (0xFFu<<0)
#define SAADC_PUBLISH_DONE_CHIDX_0                                      (0x1u<<0)
#define SAADC_PUBLISH_DONE_EN_DISABLED                                  (0x0u<<31)
#define SAADC_PUBLISH_DONE_EN_ENABLED                                   (0x1u<<31)

// PUBLISH_RESULTDONE Configuration

#define SAADC_PUBLISH_RESULTDONE_EN                                     (0x1u<<31)
#define SAADC_PUBLISH_RESULTDONE_CHIDX                                  (0xFFu<<0)
#define SAADC_PUBLISH_RESULTDONE_CHIDX_0                                (0x1u<<0)
#define SAADC_PUBLISH_RESULTDONE_EN_DISABLED                            (0x0u<<31)
#define SAADC_PUBLISH_RESULTDONE_EN_ENABLED                             (0x1u<<31)

