Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
// PUBLISH_CALIBRATEDONE Configuration

#define SAADC_PUBLISH_CALIBRATEDONE_EN                                  (0x1u<<31)
#define SAADC_PUBLISH_CALIBRATEDONE_CHIDX                               (0xFFu<<0)
#define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_0                             (0x1u<<0)
#define SAADC_PUBLISH_CALIBRATEDONE_EN_DISABLED                         (0x0u<<31)
#define SAADC_PUBLISH_CALIBRATEDONE_EN_ENABLED                          (0x1u<<31)

// PUBLISH_STOPPED Configuration

#define SAADC_PUBLISH_STOPPED_EN                                        (0x1u<<31)
#define SAADC_PUBLISH_STOPPED_CHIDX                                     (0xFFu<<0)
#define SAADC_PUBLISH_STOPPED_CHIDX_0                                   (0x1u<<0)
#define SAADC_PUBLISH_STOPPED_EN_DISABLED                               (0x0u<<31)
#define SAADC_PUBLISH_STOPPED_EN_ENABLED                                (0x1u<<31)

// LIMITH Configuration

#define SAADC_PUBLISH_CH_LIMITH_EN                                      (0x1u<<31)
#define SAADC_PUBLISH_CH_LIMITH_CHIDX                                   (0xFFu<<0)
#define SAADC_PUBLISH_CH_LIMITH_CHIDX_0                                 (0x1u<<0)
#define SAADC_PUBLISH_CH_LIMITH_EN_DISABLED                             (0x0u<<31)
#define SAADC_PUBLISH_CH_LIMITH_EN_ENABLED                              (0x1u<<31)

// LIMITL Configuration

#define SAADC_PUBLISH_CH_LIMITL_EN                                      (0x1u<<31)
#define SAADC_PUBLISH_CH_LIMITL_CHIDX                                   (0xFFu<<0)
#define SAADC_PUBLISH_CH_LIMITL_CHIDX_0                                 (0x1u<<0)
#define SAADC_PUBLISH_CH_LIMITL_EN_DISABLED                             (0x0u<<31)
#define SAADC_PUBLISH_CH_LIMITL_EN_ENABLED                              (0x1u<<31)

// INTEN Configuration

#define SAADC_INTEN_CH7LIMITL                                           (0x1u<<21)
#define SAADC_INTEN_CH7LIMITH                                           (0x1u<<20)
#define SAADC_INTEN_CH6LIMITL                                           (0x1u<<19)
#define SAADC_INTEN_CH6LIMITH                                           (0x1u<<18)
#define SAADC_INTEN_CH5LIMITL                                           (0x1u<<17)
#define SAADC_INTEN_CH5LIMITH                                           (0x1u<<16)
#define SAADC_INTEN_CH4LIMITL                                           (0x1u<<15)
#define SAADC_INTEN_CH4LIMITH                                           (0x1u<<14)
#define SAADC_INTEN_CH3LIMITL                                           (0x1u<<13)
#define SAADC_INTEN_CH3LIMITH                                           (0x1u<<12)
#define SAADC_INTEN_CH2LIMITL                                           (0x1u<<11)
#define SAADC_INTEN_CH2LIMITH                                           (0x1u<<10)
#define SAADC_INTEN_CH1LIMITL                                           (0x1u<<9)
#define SAADC_INTEN_CH1LIMITH                                           (0x1u<<8)
#define SAADC_INTEN_CH0LIMITL                                           (0x1u<<7)
#define SAADC_INTEN_CH0LIMITH                                           (0x1u<<6)
#define SAADC_INTEN_STOPPED                                             (0x1u<<5)
#define SAADC_INTEN_CALIBRATEDONE                                       (0x1u<<4)
#define SAADC_INTEN_RESULTDONE                                          (0x1u<<3)
#define SAADC_INTEN_DONE                                                (0x1u<<2)
#define SAADC_INTEN_END                                                 (0x1u<<1)
#define SAADC_INTEN_STARTED                                             (0x1u<<0)
#define SAADC_INTEN_CH7LIMITL_DISABLED                                  (0x0u<<21)
#define SAADC_INTEN_CH7LIMITL_ENABLED                                   (0x1u<<21)
#define SAADC_INTEN_CH7LIMITH_DISABLED                                  (0x0u<<20)
#define SAADC_INTEN_CH7LIMITH_ENABLED                                   (0x1u<<20)
#define SAADC_INTEN_CH6LIMITL_DISABLED                                  (0x0u<<19)
#define SAADC_INTEN_CH6LIMITL_ENABLED                                   (0x1u<<19)
#define SAADC_INTEN_CH6LIMITH_DISABLED                                  (0x0u<<18)
#define SAADC_INTEN_CH6LIMITH_ENABLED                                   (0x1u<<18)
#define SAADC_INTEN_CH5LIMITL_DISABLED                                  (0x0u<<17)
#define SAADC_INTEN_CH5LIMITL_ENABLED                                   (0x1u<<17)
#define SAADC_INTEN_CH5LIMITH_DISABLED                                  (0x0u<<16)
#define SAADC_INTEN_CH5LIMITH_ENABLED                                   (0x1u<<16)
#define SAADC_INTEN_CH4LIMITL_DISABLED                                  (0x0u<<15)
#define SAADC_INTEN_CH4LIMITL_ENABLED                                   (0x1u<<15)
#define SAADC_INTEN_CH4LIMITH_DISABLED                                  (0x0u<<14)
#define SAADC_INTEN_CH4LIMITH_ENABLED                                   (0x1u<<14)
#define SAADC_INTEN_CH3LIMITL_DISABLED                                  (0x0u<<13)
#define SAADC_INTEN_CH3LIMITL_ENABLED                                   (0x1u<<13)
#define SAADC_INTEN_CH3LIMITH_DISABLED                                  (0x0u<<12)
#define SAADC_INTEN_CH3LIMITH_ENABLED                                   (0x1u<<12)
#define SAADC_INTEN_CH2LIMITL_DISABLED                                  (0x0u<<11)
#define SAADC_INTEN_CH2LIMITL_ENABLED                                   (0x1u<<11)
#define SAADC_INTEN_CH2LIMITH_DISABLED                                  (0x0u<<10)
#define SAADC_INTEN_CH2LIMITH_ENABLED                                   (0x1u<<10)
#define SAADC_INTEN_CH1LIMITL_DISABLED                                  (0x0u<<9)
#define SAADC_INTEN_CH1LIMITL_ENABLED                                   (0x1u<<9)
#define SAADC_INTEN_CH1LIMITH_DISABLED                                  (0x0u<<8)
#define SAADC_INTEN_CH1LIMITH_ENABLED                                   (0x1u<<8)
#define SAADC_INTEN_CH0LIMITL_DISABLED                                  (0x0u<<7)
#define SAADC_INTEN_CH0LIMITL_ENABLED                                   (0x1u<<7)
#define SAADC_INTEN_CH0LIMITH_DISABLED                                  (0x0u<<6)
#define SAADC_INTEN_CH0LIMITH_ENABLED                                   (0x1u<<6)
#define SAADC_INTEN_STOPPED_DISABLED                                    (0x0u<<5)
#define SAADC_INTEN_STOPPED_ENABLED                                     (0x1u<<5)
#define SAADC_INTEN_CALIBRATEDONE_DISABLED                              (0x0u<<4)
#define SAADC_INTEN_CALIBRATEDONE_ENABLED                               (0x1u<<4)
#define SAADC_INTEN_RESULTDONE_DISABLED                                 (0x0u<<3)
#define SAADC_INTEN_RESULTDONE_ENABLED                                  (0x1u<<3)
#define SAADC_INTEN_DONE_DISABLED                                       (0x0u<<2)
#define SAADC_INTEN_DONE_ENABLED                                        (0x1u<<2)
#define SAADC_INTEN_END_DISABLED                                        (0x0u<<1)
#define SAADC_INTEN_END_ENABLED                                         (0x1u<<1)
#define SAADC_INTEN_STARTED_DISABLED                                    (0x0u<<0)
#define SAADC_INTEN_STARTED_ENABLED                                     (0x1u<<0)

