Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
// INTENSET Configuration

#define SAADC_INTENSET_CH7LIMITL                                        (0x1u<<21)
#define SAADC_INTENSET_CH7LIMITH                                        (0x1u<<20)
#define SAADC_INTENSET_CH6LIMITL                                        (0x1u<<19)
#define SAADC_INTENSET_CH6LIMITH                                        (0x1u<<18)
#define SAADC_INTENSET_CH5LIMITL                                        (0x1u<<17)
#define SAADC_INTENSET_CH5LIMITH                                        (0x1u<<16)
#define SAADC_INTENSET_CH4LIMITL                                        (0x1u<<15)
#define SAADC_INTENSET_CH4LIMITH                                        (0x1u<<14)
#define SAADC_INTENSET_CH3LIMITL                                        (0x1u<<13)
#define SAADC_INTENSET_CH3LIMITH                                        (0x1u<<12)
#define SAADC_INTENSET_CH2LIMITL                                        (0x1u<<11)
#define SAADC_INTENSET_CH2LIMITH                                        (0x1u<<10)
#define SAADC_INTENSET_CH1LIMITL                                        (0x1u<<9)
#define SAADC_INTENSET_CH1LIMITH                                        (0x1u<<8)
#define SAADC_INTENSET_CH0LIMITL                                        (0x1u<<7)
#define SAADC_INTENSET_CH0LIMITH                                        (0x1u<<6)
#define SAADC_INTENSET_STOPPED                                          (0x1u<<5)
#define SAADC_INTENSET_CALIBRATEDONE                                    (0x1u<<4)
#define SAADC_INTENSET_RESULTDONE                                       (0x1u<<3)
#define SAADC_INTENSET_DONE                                             (0x1u<<2)
#define SAADC_INTENSET_END                                              (0x1u<<1)
#define SAADC_INTENSET_STARTED                                          (0x1u<<0)
#define SAADC_INTENSET_CH7LIMITL_DISABLED                               (0x0u<<21)
#define SAADC_INTENSET_CH7LIMITL_ENABLED                                (0x1u<<21)
#define SAADC_INTENSET_CH7LIMITL_SET                                    (0x1u<<21)
#define SAADC_INTENSET_CH7LIMITH_DISABLED                               (0x0u<<20)
#define SAADC_INTENSET_CH7LIMITH_ENABLED                                (0x1u<<20)
#define SAADC_INTENSET_CH7LIMITH_SET                                    (0x1u<<20)
#define SAADC_INTENSET_CH6LIMITL_DISABLED                               (0x0u<<19)
#define SAADC_INTENSET_CH6LIMITL_ENABLED                                (0x1u<<19)
#define SAADC_INTENSET_CH6LIMITL_SET                                    (0x1u<<19)
#define SAADC_INTENSET_CH6LIMITH_DISABLED                               (0x0u<<18)
#define SAADC_INTENSET_CH6LIMITH_ENABLED                                (0x1u<<18)
#define SAADC_INTENSET_CH6LIMITH_SET                                    (0x1u<<18)
#define SAADC_INTENSET_CH5LIMITL_DISABLED                               (0x0u<<17)
#define SAADC_INTENSET_CH5LIMITL_ENABLED                                (0x1u<<17)
#define SAADC_INTENSET_CH5LIMITL_SET                                    (0x1u<<17)
#define SAADC_INTENSET_CH5LIMITH_DISABLED                               (0x0u<<16)
#define SAADC_INTENSET_CH5LIMITH_ENABLED                                (0x1u<<16)
#define SAADC_INTENSET_CH5LIMITH_SET                                    (0x1u<<16)
#define SAADC_INTENSET_CH4LIMITL_DISABLED                               (0x0u<<15)
#define SAADC_INTENSET_CH4LIMITL_ENABLED                                (0x1u<<15)
#define SAADC_INTENSET_CH4LIMITL_SET                                    (0x1u<<15)
#define SAADC_INTENSET_CH4LIMITH_DISABLED                               (0x0u<<14)
#define SAADC_INTENSET_CH4LIMITH_ENABLED                                (0x1u<<14)
#define SAADC_INTENSET_CH4LIMITH_SET                                    (0x1u<<14)
#define SAADC_INTENSET_CH3LIMITL_DISABLED                               (0x0u<<13)
#define SAADC_INTENSET_CH3LIMITL_ENABLED                                (0x1u<<13)
#define SAADC_INTENSET_CH3LIMITL_SET                                    (0x1u<<13)
#define SAADC_INTENSET_CH3LIMITH_DISABLED                               (0x0u<<12)
#define SAADC_INTENSET_CH3LIMITH_ENABLED                                (0x1u<<12)
#define SAADC_INTENSET_CH3LIMITH_SET                                    (0x1u<<12)
#define SAADC_INTENSET_CH2LIMITL_DISABLED                               (0x0u<<11)
#define SAADC_INTENSET_CH2LIMITL_ENABLED                                (0x1u<<11)
#define SAADC_INTENSET_CH2LIMITL_SET                                    (0x1u<<11)
#define SAADC_INTENSET_CH2LIMITH_DISABLED                               (0x0u<<10)
#define SAADC_INTENSET_CH2LIMITH_ENABLED                                (0x1u<<10)
#define SAADC_INTENSET_CH2LIMITH_SET                                    (0x1u<<10)
#define SAADC_INTENSET_CH1LIMITL_DISABLED                               (0x0u<<9)
#define SAADC_INTENSET_CH1LIMITL_ENABLED                                (0x1u<<9)
#define SAADC_INTENSET_CH1LIMITL_SET                                    (0x1u<<9)
#define SAADC_INTENSET_CH1LIMITH_DISABLED                               (0x0u<<8)
#define SAADC_INTENSET_CH1LIMITH_ENABLED                                (0x1u<<8)
#define SAADC_INTENSET_CH1LIMITH_SET                                    (0x1u<<8)
#define SAADC_INTENSET_CH0LIMITL_DISABLED                               (0x0u<<7)
#define SAADC_INTENSET_CH0LIMITL_ENABLED                                (0x1u<<7)
#define SAADC_INTENSET_CH0LIMITL_SET                                    (0x1u<<7)
#define SAADC_INTENSET_CH0LIMITH_DISABLED                               (0x0u<<6)
#define SAADC_INTENSET_CH0LIMITH_ENABLED                                (0x1u<<6)
#define SAADC_INTENSET_CH0LIMITH_SET                                    (0x1u<<6)
#define SAADC_INTENSET_STOPPED_DISABLED                                 (0x0u<<5)
#define SAADC_INTENSET_STOPPED_ENABLED                                  (0x1u<<5)
#define SAADC_INTENSET_STOPPED_SET                                      (0x1u<<5)
#define SAADC_INTENSET_CALIBRATEDONE_DISABLED                           (0x0u<<4)
#define SAADC_INTENSET_CALIBRATEDONE_ENABLED                            (0x1u<<4)
#define SAADC_INTENSET_CALIBRATEDONE_SET                                (0x1u<<4)
#define SAADC_INTENSET_RESULTDONE_DISABLED                              (0x0u<<3)
#define SAADC_INTENSET_RESULTDONE_ENABLED                               (0x1u<<3)
#define SAADC_INTENSET_RESULTDONE_SET                                   (0x1u<<3)
#define SAADC_INTENSET_DONE_DISABLED                                    (0x0u<<2)
#define SAADC_INTENSET_DONE_ENABLED                                     (0x1u<<2)
#define SAADC_INTENSET_DONE_SET                                         (0x1u<<2)
#define SAADC_INTENSET_END_DISABLED                                     (0x0u<<1)
#define SAADC_INTENSET_END_ENABLED                                      (0x1u<<1)
#define SAADC_INTENSET_END_SET                                          (0x1u<<1)
#define SAADC_INTENSET_STARTED_DISABLED                                 (0x0u<<0)
#define SAADC_INTENSET_STARTED_ENABLED                                  (0x1u<<0)
#define SAADC_INTENSET_STARTED_SET                                      (0x1u<<0)

// INTENCLR Configuration

#define SAADC_INTENCLR_CH7LIMITL                                        (0x1u<<21)
#define SAADC_INTENCLR_CH7LIMITH                                        (0x1u<<20)
#define SAADC_INTENCLR_CH6LIMITL                                        (0x1u<<19)
#define SAADC_INTENCLR_CH6LIMITH                                        (0x1u<<18)
#define SAADC_INTENCLR_CH5LIMITL                                        (0x1u<<17)
#define SAADC_INTENCLR_CH5LIMITH                                        (0x1u<<16)
#define SAADC_INTENCLR_CH4LIMITL                                        (0x1u<<15)
#define SAADC_INTENCLR_CH4LIMITH                                        (0x1u<<14)
#define SAADC_INTENCLR_CH3LIMITL                                        (0x1u<<13)
#define SAADC_INTENCLR_CH3LIMITH                                        (0x1u<<12)
#define SAADC_INTENCLR_CH2LIMITL                                        (0x1u<<11)
#define SAADC_INTENCLR_CH2LIMITH                                        (0x1u<<10)
#define SAADC_INTENCLR_CH1LIMITL                                        (0x1u<<9)
#define SAADC_INTENCLR_CH1LIMITH                                        (0x1u<<8)
#define SAADC_INTENCLR_CH0LIMITL                                        (0x1u<<7)
#define SAADC_INTENCLR_CH0LIMITH                                        (0x1u<<6)
#define SAADC_INTENCLR_STOPPED                                          (0x1u<<5)
#define SAADC_INTENCLR_CALIBRATEDONE                                    (0x1u<<4)
#define SAADC_INTENCLR_RESULTDONE                                       (0x1u<<3)
#define SAADC_INTENCLR_DONE                                             (0x1u<<2)
#define SAADC_INTENCLR_END                                              (0x1u<<1)
#define SAADC_INTENCLR_STARTED                                          (0x1u<<0)
#define SAADC_INTENCLR_CH7LIMITL_DISABLED                               (0x0u<<21)
#define SAADC_INTENCLR_CH7LIMITL_ENABLED                                (0x1u<<21)
#define SAADC_INTENCLR_CH7LIMITL_CLEAR                                  (0x1u<<21)
#define SAADC_INTENCLR_CH7LIMITH_DISABLED                               (0x0u<<20)
#define SAADC_INTENCLR_CH7LIMITH_ENABLED                                (0x1u<<20)
#define SAADC_INTENCLR_CH7LIMITH_CLEAR                                  (0x1u<<20)
#define SAADC_INTENCLR_CH6LIMITL_DISABLED                               (0x0u<<19)
#define SAADC_INTENCLR_CH6LIMITL_ENABLED                                (0x1u<<19)
#define SAADC_INTENCLR_CH6LIMITL_CLEAR                                  (0x1u<<19)
#define SAADC_INTENCLR_CH6LIMITH_DISABLED                               (0x0u<<18)
#define SAADC_INTENCLR_CH6LIMITH_ENABLED                                (0x1u<<18)
#define SAADC_INTENCLR_CH6LIMITH_CLEAR                                  (0x1u<<18)
#define SAADC_INTENCLR_CH5LIMITL_DISABLED                               (0x0u<<17)
#define SAADC_INTENCLR_CH5LIMITL_ENABLED                                (0x1u<<17)
#define SAADC_INTENCLR_CH5LIMITL_CLEAR                                  (0x1u<<17)
#define SAADC_INTENCLR_CH5LIMITH_DISABLED                               (0x0u<<16)
#define SAADC_INTENCLR_CH5LIMITH_ENABLED                                (0x1u<<16)
#define SAADC_INTENCLR_CH5LIMITH_CLEAR                                  (0x1u<<16)
#define SAADC_INTENCLR_CH4LIMITL_DISABLED                               (0x0u<<15)
#define SAADC_INTENCLR_CH4LIMITL_ENABLED                                (0x1u<<15)
#define SAADC_INTENCLR_CH4LIMITL_CLEAR                                  (0x1u<<15)
#define SAADC_INTENCLR_CH4LIMITH_DISABLED                               (0x0u<<14)
#define SAADC_INTENCLR_CH4LIMITH_ENABLED                                (0x1u<<14)
#define SAADC_INTENCLR_CH4LIMITH_CLEAR                                  (0x1u<<14)
#define SAADC_INTENCLR_CH3LIMITL_DISABLED                               (0x0u<<13)
#define SAADC_INTENCLR_CH3LIMITL_ENABLED                                (0x1u<<13)
#define SAADC_INTENCLR_CH3LIMITL_CLEAR                                  (0x1u<<13)
#define SAADC_INTENCLR_CH3LIMITH_DISABLED                               (0x0u<<12)
#define SAADC_INTENCLR_CH3LIMITH_ENABLED                                (0x1u<<12)
#define SAADC_INTENCLR_CH3LIMITH_CLEAR                                  (0x1u<<12)
#define SAADC_INTENCLR_CH2LIMITL_DISABLED                               (0x0u<<11)
#define SAADC_INTENCLR_CH2LIMITL_ENABLED                                (0x1u<<11)
#define SAADC_INTENCLR_CH2LIMITL_CLEAR                                  (0x1u<<11)
#define SAADC_INTENCLR_CH2LIMITH_DISABLED                               (0x0u<<10)
#define SAADC_INTENCLR_CH2LIMITH_ENABLED                                (0x1u<<10)
#define SAADC_INTENCLR_CH2LIMITH_CLEAR                                  (0x1u<<10)
#define SAADC_INTENCLR_CH1LIMITL_DISABLED                               (0x0u<<9)
#define SAADC_INTENCLR_CH1LIMITL_ENABLED                                (0x1u<<9)
#define SAADC_INTENCLR_CH1LIMITL_CLEAR                                  (0x1u<<9)
#define SAADC_INTENCLR_CH1LIMITH_DISABLED                               (0x0u<<8)
#define SAADC_INTENCLR_CH1LIMITH_ENABLED                                (0x1u<<8)
#define SAADC_INTENCLR_CH1LIMITH_CLEAR                                  (0x1u<<8)
#define SAADC_INTENCLR_CH0LIMITL_DISABLED                               (0x0u<<7)
#define SAADC_INTENCLR_CH0LIMITL_ENABLED                                (0x1u<<7)
#define SAADC_INTENCLR_CH0LIMITL_CLEAR                                  (0x1u<<7)
#define SAADC_INTENCLR_CH0LIMITH_DISABLED                               (0x0u<<6)
#define SAADC_INTENCLR_CH0LIMITH_ENABLED                                (0x1u<<6)
#define SAADC_INTENCLR_CH0LIMITH_CLEAR                                  (0x1u<<6)
#define SAADC_INTENCLR_STOPPED_DISABLED                                 (0x0u<<5)
#define SAADC_INTENCLR_STOPPED_ENABLED                                  (0x1u<<5)
#define SAADC_INTENCLR_STOPPED_CLEAR                                    (0x1u<<5)
#define SAADC_INTENCLR_CALIBRATEDONE_DISABLED                           (0x0u<<4)
#define SAADC_INTENCLR_CALIBRATEDONE_ENABLED                            (0x1u<<4)
#define SAADC_INTENCLR_CALIBRATEDONE_CLEAR                              (0x1u<<4)
#define SAADC_INTENCLR_RESULTDONE_DISABLED                              (0x0u<<3)
#define SAADC_INTENCLR_RESULTDONE_ENABLED                               (0x1u<<3)
#define SAADC_INTENCLR_RESULTDONE_CLEAR                                 (0x1u<<3)
#define SAADC_INTENCLR_DONE_DISABLED                                    (0x0u<<2)
#define SAADC_INTENCLR_DONE_ENABLED                                     (0x1u<<2)
#define SAADC_INTENCLR_DONE_CLEAR                                       (0x1u<<2)
#define SAADC_INTENCLR_END_DISABLED                                     (0x0u<<1)
#define SAADC_INTENCLR_END_ENABLED                                      (0x1u<<1)
#define SAADC_INTENCLR_END_CLEAR                                        (0x1u<<1)
#define SAADC_INTENCLR_STARTED_DISABLED                                 (0x0u<<0)
#define SAADC_INTENCLR_STARTED_ENABLED                                  (0x1u<<0)
#define SAADC_INTENCLR_STARTED_CLEAR                                    (0x1u<<0)

