Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
// STATUS Configuration

#define SAADC_STATUS_STATUS                                             (0x1u<<0)
#define SAADC_STATUS_STATUS_READY                                       (0x0u<<0)
#define SAADC_STATUS_STATUS_BUSY                                        (0x1u<<0)

// ENABLE Configuration

#define SAADC_ENABLE_ENABLE                                             (0x1u<<0)
#define SAADC_ENABLE_ENABLE_DISABLED                                    (0x0u<<0)
#define SAADC_ENABLE_ENABLE_ENABLED                                     (0x1u<<0)

// PSELP Configuration

#define SAADC_CH_PSELP_PSELP                                            (0x1Fu<<0)
#define SAADC_CH_PSELP_PSELP_0                                          (0x1u<<0)
#define SAADC_CH_PSELP_PSELP_NC                                         (0x0u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT0                               (0x1u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT1                               (0x2u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT2                               (0x3u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT3                               (0x4u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT4                               (0x5u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT5                               (0x6u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT6                               (0x7u<<0)
#define SAADC_CH_PSELP_PSELP_ANALOGINPUT7                               (0x8u<<0)
#define SAADC_CH_PSELP_PSELP_VDD                                        (0x9u<<0)
#define SAADC_CH_PSELP_PSELP_VDDHDIV5                                   (0xDu<<0)

// PSELN Configuration

#define SAADC_CH_PSELN_PSELN                                            (0x1Fu<<0)
#define SAADC_CH_PSELN_PSELN_0                                          (0x1u<<0)
#define SAADC_CH_PSELN_PSELN_NC                                         (0x0u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT0                               (0x1u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT1                               (0x2u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT2                               (0x3u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT3                               (0x4u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT4                               (0x5u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT5                               (0x6u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT6                               (0x7u<<0)
#define SAADC_CH_PSELN_PSELN_ANALOGINPUT7                               (0x8u<<0)
#define SAADC_CH_PSELN_PSELN_VDD                                        (0x9u<<0)
#define SAADC_CH_PSELN_PSELN_VDDHDIV5                                   (0xDu<<0)

// CONFIG Configuration

#define SAADC_CH_CONFIG_BURST                                           (0x1u<<24)
#define SAADC_CH_CONFIG_MODE                                            (0x1u<<20)
#define SAADC_CH_CONFIG_TACQ                                            (0x7u<<16)
#define SAADC_CH_CONFIG_TACQ_0                                          (0x1u<<16)
#define SAADC_CH_CONFIG_REFSEL                                          (0x1u<<12)
#define SAADC_CH_CONFIG_GAIN                                            (0x7u<<8)
#define SAADC_CH_CONFIG_GAIN_0                                          (0x1u<<8)
#define SAADC_CH_CONFIG_RESN                                            (0x3u<<4)
#define SAADC_CH_CONFIG_RESN_0                                          (0x1u<<4)
#define SAADC_CH_CONFIG_RESP                                            (0x3u<<0)
#define SAADC_CH_CONFIG_RESP_0                                          (0x1u<<0)
#define SAADC_CH_CONFIG_BURST_DISABLED                                  (0x0u<<24)
#define SAADC_CH_CONFIG_BURST_ENABLED                                   (0x1u<<24)
#define SAADC_CH_CONFIG_MODE_SE                                         (0x0u<<20)
#define SAADC_CH_CONFIG_MODE_DIFF                                       (0x1u<<20)
#define SAADC_CH_CONFIG_TACQ_3US                                        (0x0u<<16)
#define SAADC_CH_CONFIG_TACQ_5US                                        (0x1u<<16)
#define SAADC_CH_CONFIG_TACQ_10US                                       (0x2u<<16)
#define SAADC_CH_CONFIG_TACQ_15US                                       (0x3u<<16)
#define SAADC_CH_CONFIG_TACQ_20US                                       (0x4u<<16)
#define SAADC_CH_CONFIG_TACQ_40US                                       (0x5u<<16)
#define SAADC_CH_CONFIG_REFSEL_INTERNAL                                 (0x0u<<12)
#define SAADC_CH_CONFIG_REFSEL_VDD1_4                                   (0x1u<<12)
#define SAADC_CH_CONFIG_GAIN_GAIN1_6                                    (0x0u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN1_5                                    (0x1u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN1_4                                    (0x2u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN1_3                                    (0x3u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN1_2                                    (0x4u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN1                                      (0x5u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN2                                      (0x6u<<8)
#define SAADC_CH_CONFIG_GAIN_GAIN4                                      (0x7u<<8)
#define SAADC_CH_CONFIG_RESN_BYPASS                                     (0x0u<<4)
#define SAADC_CH_CONFIG_RESN_PULLDOWN                                   (0x1u<<4)
#define SAADC_CH_CONFIG_RESN_PULLUP                                     (0x2u<<4)
#define SAADC_CH_CONFIG_RESN_VDD1_2                                     (0x3u<<4)
#define SAADC_CH_CONFIG_RESP_BYPASS                                     (0x0u<<0)
#define SAADC_CH_CONFIG_RESP_PULLDOWN                                   (0x1u<<0)
#define SAADC_CH_CONFIG_RESP_PULLUP                                     (0x2u<<0)
#define SAADC_CH_CONFIG_RESP_VDD1_2                                     (0x3u<<0)

// LIMIT Configuration

#define SAADC_CH_LIMIT_HIGH                                             (0xFFFFu<<16)
#define SAADC_CH_LIMIT_HIGH_0                                           (0x1u<<16)
#define SAADC_CH_LIMIT_LOW                                              (0xFFFFu<<0)
#define SAADC_CH_LIMIT_LOW_0                                            (0x1u<<0)

// RESOLUTION Configuration

#define SAADC_RESOLUTION_VAL                                            (0x7u<<0)
#define SAADC_RESOLUTION_VAL_0                                          (0x1u<<0)
#define SAADC_RESOLUTION_VAL_8BIT                                       (0x0u<<0)
#define SAADC_RESOLUTION_VAL_10BIT                                      (0x1u<<0)
#define SAADC_RESOLUTION_VAL_12BIT                                      (0x2u<<0)
#define SAADC_RESOLUTION_VAL_14BIT                                      (0x3u<<0)

