Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_saadc.h
// OVERSAMPLE Configuration

#define SAADC_OVERSAMPLE_OVERSAMPLE                                     (0xFu<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_0                                   (0x1u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_BYPASS                              (0x0u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER2X                              (0x1u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER4X                              (0x2u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER8X                              (0x3u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER16X                             (0x4u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER32X                             (0x5u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER64X                             (0x6u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER128X                            (0x7u<<0)
#define SAADC_OVERSAMPLE_OVERSAMPLE_OVER256X                            (0x8u<<0)

// SAMPLERATE Configuration

#define SAADC_SAMPLERATE_MODE                                           (0x1u<<12)
#define SAADC_SAMPLERATE_CC                                             (0x7FFu<<0)
#define SAADC_SAMPLERATE_CC_0                                           (0x1u<<0)
#define SAADC_SAMPLERATE_MODE_TASK                                      (0x0u<<12)
#define SAADC_SAMPLERATE_MODE_TIMERS                                    (0x1u<<12)

// PTR Configuration

#define SAADC_RESULT_PTR_PTR                                            (0xFFFFFFFFu<<0)
#define SAADC_RESULT_PTR_PTR_0                                          (0x1u<<0)

// MAXCNT Configuration

#define SAADC_RESULT_MAXCNT_MAXCNT                                      (0x7FFFu<<0)
#define SAADC_RESULT_MAXCNT_MAXCNT_0                                    (0x1u<<0)

// AMOUNT Configuration

#define SAADC_RESULT_AMOUNT_AMOUNT                                      (0x7FFFu<<0)
#define SAADC_RESULT_AMOUNT_AMOUNT_0                                    (0x1u<<0)
